In [2]:
import requests
import pandas as pd

In [3]:
url_grenoble = "https://archive-api.open-meteo.com/v1/archive?latitude=45.1787&longitude=5.7148&start_date=1950-01-01&end_date=2025-02-01&hourly=temperature_2m&timezone=Europe%2FBerlin"

url_toulouse = "https://archive-api.open-meteo.com/v1/archive?latitude=43.6043&longitude=1.4437&start_date=1950-01-01&end_date=2025-02-01&hourly=temperature_2m&timezone=Europe%2FBerlin"

url_montpellier = "https://archive-api.open-meteo.com/v1/archive?latitude=43.6109&longitude=3.8763&start_date=1950-01-01&end_date=2025-02-01&hourly=temperature_2m&timezone=Europe%2FBerlin"

url_bordeaux = "https://archive-api.open-meteo.com/v1/archive?latitude=44.8404&longitude=-0.5805&start_date=1950-01-01&end_date=2025-02-01&hourly=temperature_2m&timezone=Europe%2FBerlin"

url_bayonne = "https://archive-api.open-meteo.com/v1/archive?latitude=43.4932&longitude=-1.473&start_date=1950-01-01&end_date=2025-02-01&hourly=temperature_2m&timezone=Europe%2FBerlin"

url_marseille = "https://archive-api.open-meteo.com/v1/archive?latitude=43.297&longitude=5.3811&start_date=1950-01-01&end_date=2025-02-01&hourly=temperature_2m&timezone=Europe%2FBerlin"

url_gap  ="https://archive-api.open-meteo.com/v1/archive?latitude=44.5586&longitude=6.0787&start_date=1950-01-01&end_date=2025-02-01&hourly=temperature_2m&timezone=Europe%2FBerlin"

url_lyon = "https://archive-api.open-meteo.com/v1/archive?latitude=45.7485&longitude=4.8467&start_date=1950-01-01&end_date=2025-02-01&hourly=temperature_2m&timezone=Europe%2FBerlin"

# GRENOBLE

In [ ]:
# Get response
response_gre = requests.get(url_grenoble)
response_gre = response_gre.json()
data_gre = response_gre['hourly']

# Convert to df
df_gre = pd.DataFrame(data_gre)

# Rename column
df_gre = df_gre.rename(columns={'temperature_2m':'temperature'})

# Set date format
df_gre['time'] = pd.to_datetime(df_gre['time'], utc=True)
df_gre['time'] = pd.to_datetime(df_gre['time'], utc=True)

### Temperature by day (mean)

In [23]:
# GroupBy day
df_gre_by_day = df_gre.groupby(df_gre['time'].dt.date)['temperature'].mean().reset_index()

# Save to .csv
df_gre_by_day.to_csv("data/weather/meteo_gre_by_day.csv", index=False)
df_gre_by_day

             time  temperature
0      1950-01-01     1.645833
1      1950-01-02     1.520833
2      1950-01-03     3.595833
3      1950-01-04     5.829167
4      1950-01-05     5.741667
...           ...          ...
27421  2025-01-28     7.366667
27422  2025-01-29     5.512500
27423  2025-01-30     6.333333
27424  2025-01-31     5.383333
27425  2025-02-01     3.683333

[27426 rows x 2 columns]

### Filter temperatures

In [77]:
# Filter temperatures < 0
df_gre['year'] = df_gre['time'].dt.year

# df_gre
df_gre_0 = df_gre[df_gre['temperature'] < 0]
# df_gre_0

occurrences_gre_0_per_year = df_gre_0.groupby('year').size().reset_index(name='nb_occurrences_0').set_index('year').fillna(0)

In [78]:
# Filter temperatures > 30
df_gre['year'] = df_gre['time'].dt.year
df_gre_30 = df_gre[df_gre['temperature'] > 30]

occurrences_gre_30_per_year = df_gre_30.groupby('year').size().reset_index(name='nb_occurrences_30').set_index('year')

In [79]:
# Merge dfs
final_df_occurrences = occurrences_gre_0_per_year.merge(occurrences_gre_30_per_year, on='year', how='outer')

final_df_occurrences['nb_occurrences_30'] = final_df_occurrences['nb_occurrences_30'].fillna(0)
final_df_occurrences['nb_occurrences_30'] = final_df_occurrences['nb_occurrences_30'].astype(int)

final_df_occurrences.to_csv("data/weather/meteo_gre_occurrences.csv")

# TOULOUSE

In [25]:
# Get response
response_tls = requests.get(url_toulouse)
response_tls = response_tls.json()
data_tls = response_tls['hourly']

# Convert to df
df_tls = pd.DataFrame(data_tls)

# Rename column
df_tls = df_tls.rename(columns={'temperature_2m':'temperature'})

# GroupBy day
df_tls['time'] = pd.to_datetime(df_tls['time'], utc=True)
df_tls['time'] = pd.to_datetime(df_tls['time'], utc=True)
df_tls_by_day = df_tls.groupby(df_tls['time'].dt.date)['temperature'].mean().reset_index()

# Save to .csv
df_tls_by_day.to_csv("data/weather/meteo_tls.csv", index=False)
df_tls_by_day

             time  temperature
0      1950-01-01     6.316667
1      1950-01-02     3.400000
2      1950-01-03     4.720833
3      1950-01-04     8.529167
4      1950-01-05     7.362500
...           ...          ...
27421  2025-01-28     7.175000
27422  2025-01-29     7.912500
27423  2025-01-30     7.504167
27424  2025-01-31     5.991667
27425  2025-02-01     5.195833

[27426 rows x 2 columns]

# MONTPELLIER

In [26]:
# Get response
response_mtp = requests.get(url_montpellier)
response_mtp = response_mtp.json()
data_mtp = response_mtp['hourly']

# Convert to df
df_mtp = pd.DataFrame(data_mtp)

# Rename column
df_mtp = df_mtp.rename(columns={'temperature_2m':'temperature'})

# GroupBy day
df_mtp['time'] = pd.to_datetime(df_mtp['time'], utc=True)
df_mtp['time'] = pd.to_datetime(df_mtp['time'], utc=True)
df_mtp_by_day = df_mtp.groupby(df_mtp['time'].dt.date)['temperature'].mean().reset_index()

# Save to .csv
df_mtp_by_day.to_csv("data/weather/meteo_mtp.csv", index=False)
df_mtp_by_day

             time  temperature
0      1950-01-01     7.825000
1      1950-01-02     5.300000
2      1950-01-03     7.687500
3      1950-01-04    10.825000
4      1950-01-05     9.258333
...           ...          ...
27421  2025-01-28     9.604167
27422  2025-01-29     9.975000
27423  2025-01-30    10.758333
27424  2025-01-31     9.162500
27425  2025-02-01     6.191667

[27426 rows x 2 columns]

# BAYONNE

In [27]:
# Get response
response_bayonne = requests.get(url_bayonne)
response_bayonne = response_bayonne.json()
data_bayonne = response_bayonne['hourly']

# Convert to df
df_bayonne = pd.DataFrame(data_bayonne)

# Rename column
df_bayonne = df_bayonne.rename(columns={'temperature_2m':'temperature'})

# GroupBy day
df_bayonne['time'] = pd.to_datetime(df_bayonne['time'], utc=True)
df_bayonne['time'] = pd.to_datetime(df_bayonne['time'], utc=True)
df_bayonne_by_day = df_bayonne.groupby(df_bayonne['time'].dt.date)['temperature'].mean().reset_index()

# Save to .csv
df_bayonne_by_day.to_csv("data/weather/meteo_bayonne.csv", index=False)
df_bayonne_by_day

             time  temperature
0      1950-01-01     7.141667
1      1950-01-02     6.029167
2      1950-01-03     8.058333
3      1950-01-04    10.837500
4      1950-01-05     8.787500
...           ...          ...
27421  2025-01-28    10.633333
27422  2025-01-29    10.216667
27423  2025-01-30    10.062500
27424  2025-01-31     7.783333
27425  2025-02-01     8.487500

[27426 rows x 2 columns]

# MARSEILLE

In [28]:
# Get response
response_marseille = requests.get(url_marseille)
response_marseille = response_marseille.json()
data_marseille = response_marseille['hourly']

# Convert to df
df_marseille = pd.DataFrame(data_marseille)

# Rename column
df_marseille = df_marseille.rename(columns={'temperature_2m':'temperature'})

# GroupBy day
df_marseille['time'] = pd.to_datetime(df_marseille['time'], utc=True)
df_marseille['time'] = pd.to_datetime(df_marseille['time'], utc=True)
df_marseille_by_day = df_marseille.groupby(df_marseille['time'].dt.date)['temperature'].mean().reset_index()

# Save to .csv
df_marseille_by_day.to_csv("data/weather/meteo_marseille.csv", index=False)
df_marseille_by_day

             time  temperature
0      1950-01-01     8.091667
1      1950-01-02     5.691667
2      1950-01-03     8.691667
3      1950-01-04    10.975000
4      1950-01-05     9.683333
...           ...          ...
27421  2025-01-28    11.445833
27422  2025-01-29    10.883333
27423  2025-01-30    11.412500
27424  2025-01-31     9.425000
27425  2025-02-01     8.775000

[27426 rows x 2 columns]

# GAP

In [31]:
# Get response
response_gap = requests.get(url_gap)
response_gap = response_gap.json()
data_gap = response_gap['hourly']

# Convert to df
df_gap = pd.DataFrame(data_gap)

# Rename column
df_gap = df_gap.rename(columns={'temperature_2m':'temperature'})

# GroupBy day
df_gap['time'] = pd.to_datetime(df_gap['time'], utc=True)
df_gap['time'] = pd.to_datetime(df_gap['time'], utc=True)
df_gap_by_day = df_gap.groupby(df_gap['time'].dt.date)['temperature'].mean().reset_index()

# Save to .csv
df_gap_by_day.to_csv("data/weather/meteo_gap.csv", index=False)
df_gap_by_day

             time  temperature
0      1950-01-01    -0.016667
1      1950-01-02    -4.316667
2      1950-01-03    -0.920833
3      1950-01-04     1.370833
4      1950-01-05     0.225000
...           ...          ...
27421  2025-01-28     4.283333
27422  2025-01-29     1.000000
27423  2025-01-30     3.525000
27424  2025-01-31     4.370833
27425  2025-02-01     2.745833

[27426 rows x 2 columns]

# LYON

In [32]:
# Get response
response_lyon = requests.get(url_lyon)
response_lyon = response_lyon.json()
data_lyon = response_lyon['hourly']

# Convert to df
df_lyon = pd.DataFrame(data_lyon)

# Rename column
df_lyon = df_lyon.rename(columns={'temperature_2m':'temperature'})

# GroupBy day
df_lyon['time'] = pd.to_datetime(df_lyon['time'], utc=True)
df_lyon['time'] = pd.to_datetime(df_lyon['time'], utc=True)
df_lyon_by_day = df_lyon.groupby(df_lyon['time'].dt.date)['temperature'].mean().reset_index()

# Save to .csv
df_lyon_by_day.to_csv("data/weather/meteo_lyon.csv", index=False)
df_lyon_by_day

             time  temperature
0      1950-01-01    -0.245833
1      1950-01-02    -0.208333
2      1950-01-03     2.604167
3      1950-01-04     8.012500
4      1950-01-05     7.066667
...           ...          ...
27421  2025-01-28     7.366667
27422  2025-01-29     7.604167
27423  2025-01-30     7.379167
27424  2025-01-31     5.625000
27425  2025-02-01     2.862500

[27426 rows x 2 columns]